''' '''
# 练习：
# 1. 打印1-100之间的所有偶数

n = 1
while n <= 100:
    if n % 2 == 0:
        print('n:{}'.format(n))
    n += 1
print('----')
# 2.求 1-100之间可以被6整除的数的个数
n = 1
sum_ = 0
while n <= 20:
    if n % 6 == 0:
        sum_ = sum_ + n
    n += 1
print(f"1~100之间的能被6整数的数的和:{sum_}")
print('----')
# 3. 打印1-100之间的所有奇数
n = 1
num = 0
while n <= 100:
    if n % 2 != 0:
        num += 1
    n += 1
print(f"1~100之间的奇数的个数: {num}")
print('----')
# 4.计算1到100以内所有偶数的和。

n = 1
sum_ = 0
while n <= 100:
    if n % 2 == 0:
        sum_ += n
    n += 1
print(f"1到100以内所有偶数的和: {sum_}")
print('----')
# 5.计算1到100以内所有能被3或者7整除的数的和。
n = 1
sum_ = 0
while n <= 100:
    if n % 3 == 0 or n % 7 == 0:
        sum_ += n
    n += 1
print(f'1到100以内所有能被3或者7整除的数的和: {sum_}')
# 6.计算1到100以内能同时被7和3整除的数的个数。

print('----')
n = 1
sum_ = 0
while n <= 100:
    if n % 3 == 0 and n % 7 == 0:
        sum_ += 1
    n += 1
print(f'1到100以内所有能被3或者7整除的数的和: {sum_}')
